[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "WhatsApp is the leading free messaging and video calling app used by over 2 billion people in more than 180 countries. It offers simple, reliable, and private communication for keeping in touch with friends and family across the globe. All personal messages and calls are secured with end-to-end encryption, ensuring privacy as no one outside of your chats, not even WhatsApp, can read or listen to them. The app functions across both mobile and desktop devices, even with slower internet connections, and is free of subscription fees. Users can enjoy group chats, voice messages, and media sharing, making it a universal communication tool.",
    "size": 128.6,
    "reviews": 121300,
    "ratingAvg": 4.7,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 10000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 30000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 50000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/51/Facebook_f_logo_%282019%29.svg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Facebook is a massive global social networking platform connecting billions of users, allowing you to easily stay connected with friends, family, and communities across the world. Users can share life updates, photos, and videos to their personal feeds and engage with content through likes and comments. The platform facilitates group creation for shared interests, offers private messaging via Messenger, and includes a Marketplace for local commerce. It is a central place for people to follow breaking news, join cultural conversations, and maintain their social graph, offering tools for both personal interaction and business engagement.",
    "size": 391.5,
    "reviews": 22700000,
    "ratingAvg": 4.5,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 5000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/95/Instagram_logo_2022.svg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is a vibrant, image-centric social networking service focused on photo and video sharing, owned by Meta Platforms. It empowers users to capture and share moments, edit media with creative filters and tools, and organize content using hashtags and geographical tags. Key features include Instagram Reels for short, engaging videos, Stories for transient daily updates, and Instagram Direct for private communication. The Explore tab allows users to discover trending content, follow creators, and find inspiration based on their interests. It’s a global platform for visual storytelling, creative expression, and building a public or private community around visual media.",
    "size": 493.1,
    "reviews": 28200000,
    "ratingAvg": 4.7,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/9f7Phd0/Tiktok-Logo-Tiktok-logo-HD-JPEG-file.jpg",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 4,
    "description": "TikTok is the premier global platform for exciting, spontaneous, and genuine short-form mobile videos. It provides a highly personalized, endless stream of content across every imaginable category, from comedy and gaming to education and lifestyle. The app makes creation easy with integrated editing tools, special effects, filters, and a massive library of popular music and original sounds. Users are part of a global community of creators, showcasing incredible skills and everyday life. With seamless tools to trim, cut, and merge clips, TikTok allows anyone to create engaging content and be entertained throughout their day.",
    "size": 635.9,
    "reviews": 1300000,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/svyr6t0f/9c9e933c-2278-4528-ac66-3214ff7472d2.jpg",
    "title": "Spotify",
    "companyName": "Spotify Technology S.A.",
    "id": 5,
    "description": "Spotify is the leading digital music, podcast, and audiobook streaming service, providing access to over 100 million songs and 6 million podcast titles. Users can stream music for free, create and share personalized playlists, and receive tailored recommendations like 'Discover Weekly.' The platform allows users to explore specially-crafted artist playlists, stay informed with 'Release Radar,' and find new music across every genre. Spotify Premium enhances the experience with ad-free listening, offline downloads, superior sound quality, and the unique AI DJ feature, allowing for seamless audio entertainment across all devices.",
    "size": 234.6,
    "reviews": 25300,
    "ratingAvg": 4.8,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 3000 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 5000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/42/YouTube_icon_%282013-2017%29.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "YouTube is the official video sharing service from Google, offering a vast, diverse library of content for users to watch, share, and upload. It is the world's primary source for everything from trending music videos and popular gaming content to news, educational videos, and live streams. Users can browse personalized recommendations, subscribe to their favorite channels to follow the latest updates, and look up videos they've watched or saved in their Library. The platform encourages community interaction through comments, and it provides tools for creators to film and upload videos directly from their mobile devices.",
    "size": 339.4,
    "reviews": 10000000,
    "ratingAvg": 4.5,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/23m2GGs6/713eacb5-0c24-4239-b6ad-610bdd16ce83.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 7,
    "description": "Snapchat is a fast and fun multimedia messaging app designed to share moments with friends and family using photos and videos that disappear after being viewed. The app opens directly to the camera, allowing users to express themselves instantly with a huge variety of Lenses, Filters, and Bitmoji. Key features include 'Stories' for seeing a friend's day unfold, 'Chat' for live messaging and video calls, and 'Spotlight' which showcases the best public Snaps. The 'Snap Map' allows users to share their location and explore live stories nearby, making it a dynamic platform for both intimate communication and global discovery.",
    "size": 316.4,
    "reviews": 536700,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLy1Bks5/451782b4-0c8e-4615-a4c1-c38eeb4d44bc.jpg",
    "title": "Twitter (X)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "Welcome to X (formerly Twitter), your trusted digital town square where conversations unfold in real time. It is a vital microblogging and social networking service where users post and interact with short messages known as 'posts' or 'tweets.' X is the ultimate destination for staying informed, providing a front-row seat to breaking news, live events, and trending global conversations across politics, tech, music, and sports. Users can post their thoughts, photos, and videos, connect with a global community through Direct Messages, and join custom communities. The platform offers real-time updates and diverse perspectives, allowing users to shape and follow public dialogue instantly.",
    "size": 0.8,
    "reviews": 27225,
    "ratingAvg": 4.2,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 15000 },
      { "name": "4 star", "count": 20000 },
      { "name": "5 star", "count": 25000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/b54Wnmcf/810a30ac-9c7e-4696-a0fb-93f52a28f777.jpg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 9,
    "description": "Netflix is the world's leading subscription-based streaming service, providing an immense library of award-winning TV series, movies, documentaries, and stand-up specials from around the globe. Users can browse new titles, search for favorites, and stream content instantly on any device. The platform excels at personalized recommendations, improving the suggestions the more you watch, ensuring you always find something new to love. It also offers a dedicated, safe watching experience for kids with family-friendly entertainment. With a month-to-month membership, you can easily cancel anytime, offering complete flexibility to enjoy high-quality entertainment at home or on the go.",
    "size": 350.7,
    "reviews": 8900000,
    "ratingAvg": 4.6,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/G3vBtqfc/a52d0702-fc91-4d3a-9908-76d22495416f.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Gmail is the official email service from Google, bringing a robust and secure email experience to your mobile device. It features industry-leading security, automatically blocking over 99.9% of spam, phishing, and malware from ever reaching your inbox. The app is highly efficient with smart features like Smart Reply suggestions and integrated Google Chat and Meet for seamless communication and collaboration. Users can easily manage multiple accounts, organize their mail with labeling and starring, and use search with instant results and predictions to find any email quickly. It also allows for 'Undo Send' to prevent embarrassing mistakes.",
    "size": 129.2,
    "reviews": 2500000,
    "ratingAvg": 4.5,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zTYqNJ89/c9982a7c-8e99-4bf2-a375-59b39d54603e.jpg",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Google Drive, a core part of Google Workspace, is a powerful cloud storage service that lets you securely store, intelligently organize, and collaborate on files from any location and device. Users can safely back up and access over 100 file types, including PDFs, Office files, and videos. It provides seamless collaboration features, allowing you to share files and folders with customizable permissions and receive notifications about important activity. The app also features a handy function to scan and upload paper documents using your device's camera. Every Google Account comes with 15GB of free storage shared across Drive, Gmail, and Google Photos.",
    "size": 210.5,
    "reviews": 1800000,
    "ratingAvg": 4.7,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 350000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vvgKdcY8/64ba8116-9086-4df8-b0d2-45773e16b022.jpg",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Google Photos is the dedicated home for all your photos and videos, designed to help you easily back up, edit, organize, and search your memories using Google AI. The service provides 15 GB of cloud storage, shared with other Google services, ensuring your memories are automatically and securely saved across all your devices. Its powerful AI-powered tools allow for complex edits in just a few taps, such as removing distractions with Magic Eraser or improving blurry photos with Unblur. You can relive favorite moments, share albums with contacts, and utilize 'Ask Photos' for simple or complex searches to quickly find exactly what you're looking for.",
    "size": 180.3,
    "reviews": 2200000,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 350000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Kp0YVbnw/ZOOM-Cloud-Meetings-4-Zoom.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 13,
    "description": "Zoom is a leading video-first unified communications platform, known for its high-quality, reliable performance in video meetings, webinars, and team collaboration. The application, now branded as Zoom Workplace, allows users to schedule or join video meetings with one tap, place and receive phone calls, and brainstorm using virtual whiteboards. It includes advanced features like AI Companion for generating meeting summaries and drafting content, enhancing productivity for users on the go. Zoom allows for seamless movement of live meetings between devices and supports multitasking, solidifying its place as the go-to tool for business and personal connectivity across the globe.",
    "size": 255.7,
    "reviews": 950000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 250000 },
      { "name": "5 star", "count": 400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/FbmG3NzK/Vector-square-linkedin-logo-isolated-on.jpg",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 14,
    "description": "LinkedIn is the world's largest professional networking platform, designed to help individuals begin and advance their careers. It serves as a comprehensive tool for job searches, allowing users to research companies, set up job alerts for local or remote positions, and apply quickly with their professional profile. Users can build their resume online, showcase their experience, and expand their network of business contacts. The platform also acts as a source for relevant business news and industry insights, enabling professionals to stay informed, connect with recruiters, and engage in conversations that enhance their career growth and workplace experience.",
    "size": 312.8,
    "reviews": 1200000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/sp4Wq9Dd/922e9262-9e09-42d1-b255-a3ed9aa3b44f.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ LLC",
    "id": 15,
    "description": "Telegram is a cloud-based mobile and desktop messaging app renowned for its exceptional speed, high-level security, and cross-platform access. Messages are delivered faster than many competing chat apps, and the service offers end-to-end encryption for 'Secret Chats' alongside its default secure communication. A major differentiator is the ability to save the entire message history, images, and files to the cloud, allowing users to access all content from any linked device. It also supports large group chats and public broadcasting 'Channels,' emphasizing a strong focus on privacy and efficient, seamless communication for both individual and community use.",
    "size": 245.4,
    "reviews": 680000,
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 250000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/yFsYBKjX/Pinterest-Pinterest.jpg",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 16,
    "description": "Pinterest is a visual discovery engine and unlimited vision board where users can find, save, and organize ideas across countless categories, including recipes, home decor, fashion, and DIY projects. The platform allows you to create 'Boards' and save 'Pins'—images and videos that link back to the original source—to build a personalized collection of inspiration. It is a wonderfully designed app for planning a trip, remodeling a home, or finding a new style. Pinterest serves as a powerful tool for discovering new things and visualizing creative ideas, making it a constant source of inspiration for building the life you love.",
    "size": 190.2,
    "reviews": 720000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 250000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d0jBxVQF/Discord-Logo-Icon-editorial-vector.jpg",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 17,
    "description": "Discord is a versatile voice, video, and text communication platform initially designed for gamers but now widely used for all types of communities. Users can create private, invite-only spaces called 'servers' for friends or public communities around shared interests. It offers high-quality, low-latency voice and video streaming, making it feel like you're hanging out in the same room. Key features include custom emoji, stickers, and soundboard effects to personalize chats. Discord makes it easy to hop in and out of voice channels without needing a formal call, facilitating spontaneous connections for playing games, watching videos, or just hanging out.",
    "size": 280.6,
    "reviews": 1100000,
    "ratingAvg": 4.7,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5gbGMgMw/4c746f22-8cd4-48a1-8171-49f05ba42242.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 18,
    "description": "Reddit, often called 'the front page of the internet,' is a vast social news aggregation and discussion platform composed of over 100,000 diverse online communities known as 'subreddits.' Users post content, and the community rates it using upvotes and downvotes, determining its visibility. This system of 'karma' helps popular and relevant posts rise to the top. On Reddit, you’ll find authentic and engaging conversations around every topic imaginable, from breaking news and social trends to niche fandoms and support groups. It's a unique platform where users can ask anonymous questions, participate in 'Ask Me Anything' sessions, and engage in deeply specific discussion threads.",
    "size": 210.1,
    "reviews": 840000,
    "ratingAvg": 4.4,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 60000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 120000 },
      { "name": "4 star", "count": 180000 },
      { "name": "5 star", "count": 300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zVNGGsMt/dc993cc9-a630-4e98-8251-f5844cf96a32.jpg",
    "title": "Quora",
    "companyName": "Quora Inc.",
    "id": 19,
    "description": "Quora is a leading question-and-answer platform dedicated to empowering people to share and grow the world's knowledge. Users come to Quora to ask questions on any subject, from general knowledge to specialized expertise, and receive helpful answers from credible people with first-hand knowledge. The platform’s strength lies in its ability to personalize and present high-quality, relevant content to each user. By following specific topics, users can browse a feed of curated information. Quora fosters a community that shares knowledge and encourages a deeper understanding of the world through crowdsourced expertise and structured Q&A format.",
    "size": 150.7,
    "reviews": 530000,
    "ratingAvg": 4.3,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 120000 },
      { "name": "5 star", "count": 250000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PGLPNP72/92b0182d-946b-419a-88bc-b705a2de0f98.jpg",
    "title": "Google Play Store",
    "companyName": "Google LLC",
    "id": 20,
    "description": "Google Play Store is the official digital distribution service developed and operated by Google, serving as the primary app store for certified Android and ChromeOS devices. It allows users to securely browse and download millions of applications, games, and other digital media. The platform offers a diverse catalog of both free and paid content, enabling developers to publish apps and offer early access through alpha or beta testing. The Play Store provides comprehensive security features and transparent data collection information, ensuring users can find and safely install apps that leverage their device's specific hardware capabilities.",
    "size": 50.4,
    "reviews": 3000000,
    "ratingAvg": 4.6,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1500000 }
    ]
  }
]